```data.github_repositories.organization_repos: Reading...
data.github_team.team["observe-employees"]: Reading...
data.github_organization.org_info: Reading...
data.github_organization_teams.all: Reading...
data.github_team.team["integrations"]: Reading...
data.github_repositories.organization_repos: Read complete after 0s [id=org:hutchic-observe-meta]
data.github_organization_teams.all: Read complete after 1s [id=O_kgDOB-_i5g]
data.github_organization.org_info: Read complete after 2s [id=133161702]
data.github_team.team["observe-employees"]: Read complete after 3s [id=7892627]
data.github_team.team["integrations"]: Read complete after 4s [id=7890435]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_membership.organization_members["colinh-kong"] will be created
  + resource "github_membership" "organization_members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "colinh-kong"
    }

  # github_membership.organization_members["hutchic"] will be created
  + resource "github_membership" "organization_members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "hutchic"
    }

  # github_repository.enable_security_alerts["testing"] will be created
  + resource "github_repository" "enable_security_alerts" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "testing"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = (known after apply)
      + vulnerability_alerts        = true

      + security_and_analysis {
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }

  # github_team.parent_teams["observe-employees"] will be created
  + resource "github_team" "parent_teams" {
      + create_default_maintainer = false
      + description               = "observe-employees team"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "observe-employees"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.teams["frontend"] will be created
  + resource "github_team" "teams" {
      + create_default_maintainer = false
      + description               = "Frontend subteam"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "frontend"
      + node_id                   = (known after apply)
      + parent_team_id            = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.teams["integrations"] will be created
  + resource "github_team" "teams" {
      + create_default_maintainer = false
      + description               = "Integrations subteam"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "integrations"
      + node_id                   = (known after apply)
      + parent_team_id            = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.parent_team_members["colinh-kong:observe-employees"] will be created
  + resource "github_team_membership" "parent_team_members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "colinh-kong"
    }

  # github_team_membership.parent_team_members["hutchic:observe-employees"] will be created
  + resource "github_team_membership" "parent_team_members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "hutchic"
    }

  # github_team_membership.team_members["colinh-kong:frontend"] will be created
  + resource "github_team_membership" "team_members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "colinh-kong"
    }

  # github_team_membership.team_members["colinh-kong:integrations"] will be created
  + resource "github_team_membership" "team_members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "colinh-kong"
    }

  # github_team_membership.team_members["hutchic:integrations"] will be created
  + resource "github_team_membership" "team_members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "hutchic"
    }

  # github_team_repository.team_repo["testing-integrations"] will be created
  + resource "github_team_repository" "team_repo" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "write"
      + repository = "testing"
      + team_id    = "7890435"
    }

  # github_team_repository.team_repo["testing-observe-employees"] will be created
  + resource "github_team_repository" "team_repo" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "read"
      + repository = "testing"
      + team_id    = "7892627"
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + unmanaged_org_members = [
      + "The member obs-gh-colinhutchinson is not managed by Terraform.",
    ]
  + unmanaged_repos       = {
      + template-template  = "The template-template repository is not managed by terraform."
      + template-terraform = "The template-terraform repository is not managed by terraform."
      + tf-github          = "The tf-github repository is not managed by terraform."
    }
  + unmanaged_teams       = [
      + "The engineering team is not managed by Terraform.",
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```